nnn112358/pico-faces-tab5/sdkconfig.defaults
# ---- pico-faces on M5Stack Tab5 (ESP32-P4 / 16 MB Flash / 32 MB HEX PSRAM / 1280x720 MIPI-DSI) ----
# 板の設定は SanoTTS-jp-Tab5（同じ Tab5 で実機確認済み）から持ってきた。

CONFIG_IDF_TARGET="esp32p4"

# --- ボード ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Tab5 の PSRAM は 32 MB HEX
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
# .bss を PSRAM に置けるようにしておく（内部 RAM が足りないときに linker.lf で使う）
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Tab5 の USB-C は P4 の native USB Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- 性能 ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# 生成中はコア 0 のタスクが数秒間 CPU を占有する（idle が走れない）ので TWDT は切る
CONFIG_ESP_TASK_WDT_INIT=n

CONFIG_PARTITION_TABLE_CUSTOM=y
# P4 のブートローダは 0x6120 B。表のオフセットを 0x10000 にする
CONFIG_PARTITION_TABLE_OFFSET=0x10000
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# P4 の L2 キャッシュは 768 KB の L2MEM から切り出される。256 KB にして RAM 512 KB を確保
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_SPI_FLASH_ROM_IMPL=n

# --- チップリビジョン: Tab5 の ESP32-P4 は v1.0 ---
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
